Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
/**
 ******************************************************************************
 * @file           : terminal.c
 * @brief          : ANSI/VT100 Terminal Graphics Driver and Protocol Handler.
 * @details		   : Provides a high-level API for controlling ANSI-compatible
 * terminals (e.g., PuTTY, Tera Term). Core features include:
 * - Cursor and Terminal control using ANSI Escape Sequences.
 * - Primitive drawing (Lines, Rectangles, Triangles, Circles).
 * - Character and String rendering.
 * @note           : All coordinates (col, row) are 1-based to maintain
 * consistency with ANSI/VT100 standards.
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
// Project libraries
#include "terminal.h"
#include "serial_hw.h"

// STM32 libraries
#include "main.h"
#include "stm32f407xx.h"

// Standard libraries
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* Private Defines -----------------------------------------------------------*/
#define COLOUR_SEGMENT_MAX_LEN 12 // Enough for "48;5;255\0"
#define COLOUR_BUFFER_SIZE     32 // Enough for "\x1b[38;5;255;48;5;255m\0"
#define CURSOR_BUFFER_SIZE     16 // Enough for"ESC[255;255H"
#define DIMENSIONS_BUFFER_SIZE 20 // enough for "ESC[8;255;255t"

/* Private Variables ---------------------------------------------------------*/
static uint8_t framebuffer[TERMINAL_BUFFER_SIZE];

/* Private Function Prototypes -----------------------------------------------*/
static void NormalizeCoordinates_(uint16_t *col, uint16_t *row);
static uint8_t IsValidPos_(uint16_t col, uint16_t row);
static int BuildColourSequence_(char *buffer, size_t buf_size, uint16_t colour, uint8_t is_fg);
static void DrawChar_(char c, uint16_t col, uint16_t row);
static void DrawLineHorizontal_(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1);
static void DrawLineVertical_(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1);

/* Private Functions ---------------------------------------------------------*/
/**
 * @fn static void NormalizeCoordinates_(int16_t *col, int16_t *row)
 * @brief Internal function to ensure that the provided column and row
 * coordinates are at least 1 for ANSI terminal compatibility.
 * @param col Pointer to the column number (1-based index).
 * @param row Pointer to the row number (1-based index).
 */
static void NormalizeCoordinates_(uint16_t *col, uint16_t *row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	if (*row == 0)
		*row = 1;
	if (*col == 0)
		*col = 1;
}

/**
 * @fn static uint8_t IsValidPos_(uint16_t col, uint16_t row)
 * @brief Internal function to check if the provided column and row
 * coordinates are within the valid terminal bounds.
 * @param col The column number (1-based index).
 * @param row The row number (1-based index).
 * @return TRUE if the position is valid, FALSE otherwise.
 */
static uint8_t IsValidPos_(uint16_t col, uint16_t row)
{
	// Check the maximum screen bounds
	if (row < 1 || row > TERMINAL_HEIGHT || col < 1 || col > TERMINAL_WIDTH)
		return FALSE;

	// Return position is valid
	return TRUE;
}

/**
 * @fn static int BuildColourSequence_(char *buffer, size_t buf_size, uint16_t colour, uint8_t is_fg)
 * @brief Internal function to build an ANSI escape sequence for setting either foreground or background colour.
 * This function handles both standard ANSI colours and extended 256-colour mode by checking the colour value against
 * the EXTENDED_COLOURS_OFFSET. It formats the appropriate ANSI command into the provided buffer and returns the length
 * of the formatted string.
 * @param buffer The character buffer to write the ANSI escape sequence into.
 * @param buf_size The size of the provided buffer to prevent overflow.
 * @param colour The colour value, which can be a standard ANSI colour or an extended colour (offset by
 * EXTENDED_COLOURS_OFFSET).
 * @param is_fg TRUE if the colour is for the foreground (text), FALSE if it is for the background.
 * @return The length of the formatted ANSI escape sequence string, or a negative value if formatting failed or the
 * buffer was too small.
 */
static int BuildColourSequence_(char *buffer, size_t buf_size, uint16_t colour, uint8_t is_fg)
{
	if (colour >= EXTENDED_COLOURS_OFFSET)
	{
		// Adjust the colour value for extended colours
		colour -= EXTENDED_COLOURS_OFFSET;

		if (is_fg == TRUE)
		{
			// Format based on the extended ANSI forground text colour \x1b[38;5;82m
			return snprintf(buffer, buf_size, "38;5;%d", colour);
		} else
		{
			// Format based on the extended ANSI background colour \x1b[48;5;82m
			return snprintf(buffer, buf_size, "48;5;%d", colour);
		}

	} else
	{
		// Format based on the Standard ANSI background colour \x1b[32m
		return snprintf(buffer, buf_size, "%d", colour);
	}
}

/**
 * @fn static void DrawChar_(char c, uint16_t col, uint16_t row)
 * @brief Internal function for drawing a single character into the
 * terminal framebuffer at the specified row and column. This is a static function and does NOT
 * perform bounds checking. This function updates the internal framebuffer array but does NOT
 * send any data to the terminal.
 * @param c The character to draw.
 * @param col The target column number (1-based index).
 * @param row The target row number (1-based index).
 */
static void DrawChar_(char c, uint16_t col, uint16_t row)
{
	// Check if the starting position is within the screen boundaries
	if (!IsValidPos_(col, row))
		return;

	// Calculate the 1D array index for the 2D framebuffer
	uint32_t index = ((row - 1) * TERMINAL_WIDTH) + (col - 1);

	// Store the character in the framebuffer
	framebuffer[index] = c;
}

/**
 * @fn static void DrawLineHorizontal_(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Internal function for drawing a horizontal line using Bresenham's algorithm.
 * This function draws a line from (x0, y0) to (x1, y1) in the terminal framebuffer
 * using the specified character. This is a static function and does NOT perform bounds checking.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
static void DrawLineHorizontal_(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Make sure to draw from left to right
	if (x0 > x1)
	{
		// Swap x0 and x1
		uint16_t temp_x = x0;
		x0 = x1;
		x1 = temp_x;

