Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
	// Check if sprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence via using the precise length calculated by sprintf
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalSetAttribute(TerminalAttr_t attribute)
 * @brief Sets a specific text attribute (e.g., bold, underline) in the terminal using ANSI escape sequences.
 * This function takes a TerminalAttr_t enum value and sends the corresponding ANSI command to enable that attribute.
 * @param attribute The text attribute to set, specified as a value from the TerminalAttr_t enum.
 */
void TerminalSetAttribute(TerminalAttr_t attribute)
{
	switch (attribute)
	{
		case TERM_ATTR_RESET:
			SerialPrint(ANSI_RESET_STYLE);
			break;
		case TERM_ATTR_BOLD:
			SerialPrint(ANSI_BOLD);
			break;
		case TERM_ATTR_DIM:
			SerialPrint(ANSI_DIM);
			break;
		case TERM_ATTR_UNDERLINE:
			SerialPrint(ANSI_UNDERLINE);
			break;
		case TERM_ATTR_BLINK:
			SerialPrint(ANSI_BLINK);
			break;
		case TERM_ATTR_REVERSE:
			SerialPrint(ANSI_REVERSE_MODE);
			break;
		case TERM_ATTR_STRIKE:
			SerialPrint(ANSI_STRIKETHROUGH);
			break;
		case TERM_ATTR_RESET_BOLD:
			SerialPrint(ANSI_RESET_BOLD);
			break;

		case TERM_ATTR_RESET_UNDERLINE:
			SerialPrint(ANSI_RESET_UNDERLINE);
			break;
		case TERM_ATTR_RESET_BLINK:
			SerialPrint(ANSI_RESET_BLINK);
			break;
		case TERM_ATTR_RESET_REVERSE_MODE:
			SerialPrint(ANSI_RESET_REVERSE_MODE);
			break;
		case TERM_ATTR_RESET_STRIKE:
			SerialPrint(ANSI_RESET_STRIKETHROUGH);
			break;
		default:
			break;
	}
}

/**
 * @fn void TerminalResetStyle(void)
 * @brief Sends the ANSI escape sequence to reset all terminal styles to default.
 * This function uses the ANSI_RESET_STYLE (ESC[0m) to clear any applied
 * text formatting, colours, or other styles and return to the default terminal appearance.
 */
void TerminalResetStyle(void)
{
	// Transmit the ANSI command string for resetting all styles to default
	SerialPrint(ANSI_RESET_STYLE);
}

/**
 * @fn void TerminalSetColour(ForegroundColour_t text_colour, BackgroundColour_t background_colour)
 * @brief Sets the terminal text (foreground) and background colours using ANSI escape sequences.
 * This function sends the appropriate ANSI command to change both text and background colours.
 * @param text_colour The desired foreground colour from the ForegroundColour_t enum.
 * @param background_colour The desired background colour from the BackgroundColour_t enum.
 */
void TerminalSetColour(ForegroundColour_t text_colour, BackgroundColour_t background_colour)
{
	// Temporary buffers to hold the ANSI escape sequences for foreground and background colours
	char buffer[COLOUR_BUFFER_SIZE];
	char fg_seg[COLOUR_SEGMENT_MAX_LEN];
	char bg_seg[COLOUR_SEGMENT_MAX_LEN];

	// Build the ANSI escape sequences for foreground and background colours
	BuildColourSequence_(fg_seg, sizeof(fg_seg), (int)text_colour, TRUE);
	BuildColourSequence_(bg_seg, sizeof(bg_seg), (int)background_colour, FALSE);

	// Combine the foreground and background escape sequence into a single ANSI escape sequence
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%s;%sm", fg_seg, bg_seg);

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalSetTextColour(ForegroundColour_t text_colour)
 * @brief Sets the terminal text (foreground) colour using ANSI escape sequences.
 * This function sends the appropriate ANSI command to change only the text colour.
 * @param text_colour The desired foreground colour from the ForegroundColour_t enum.
 */
void TerminalSetTextColour(ForegroundColour_t text_colour)
{
	// Temporary buffers to hold the ANSI escape sequences for foreground
	char buffer[COLOUR_BUFFER_SIZE];
	char fg_seg[COLOUR_SEGMENT_MAX_LEN];

	// Build the ANSI escape sequences for foreground
	BuildColourSequence_(fg_seg, sizeof(fg_seg), (int)text_colour, TRUE);

	// Format the escape sequence to set the foreground text colour
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%sm", fg_seg);

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalSetBackgroundColour(BackgroundColour_t background_colour)
 * @brief Sets the terminal background colour using ANSI escape sequences.
 * This function sends the appropriate ANSI command to change only the background colour.
 * @param background_colour The desired background colour from the BackgroundColour_t enum.
 */
void TerminalSetBackgroundColour(BackgroundColour_t background_colour)
{
	// Temporary buffers to hold the ANSI escape sequences for background colours
	char buffer[COLOUR_BUFFER_SIZE];
	char bg_seg[COLOUR_SEGMENT_MAX_LEN];

	// Build the ANSI escape sequences for background colours
	BuildColourSequence_(bg_seg, sizeof(bg_seg), (int)background_colour, FALSE);

	// Format the escape sequence to set the foreground text colour
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%sm", bg_seg);

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the buffer size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalPrintN(const char *str, uint16_t len)
 * @brief Transmits exactly len bytes of str to the terminal via serial_hw.
 * This is the single gateway for sending pre-formatted data (escape sequences,
 * raw characters) to the hardware. All application modules must use this
 * function instead of calling serial_hw directly.
 * @param str Pointer to the data to transmit. Does not need to be null-terminated.
 * @param len Number of bytes to transmit.
 */
void TerminalPrintN(const char *str, uint16_t len)
{
	SerialPrintN(str, len);
}

/**
 * @fn void TerminalPrint(const char *str)
 * @brief Transmits a null-terminated string to the terminal via serial_hw.
 * Convenience wrapper around TerminalPrintN for callers that have a
 * null-terminated string and do not want to compute its length manually.
 * @param str Null-terminated string to transmit.
 */
void TerminalPrint(const char *str)
{
	SerialPrint(str);
}

/**
 * @fn void TerminalPrintString(const char *str, uint16_t col, uint16_t row)
 * @brief DDraws a string directly to the terminal at the specified row and column.
 * @param str The string to draw.
 * @param col The target column number (1-based index).
 * @param row The target row number (1-based index).
 */
void TerminalPrintString(const char *str, uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&col, &row);

	// Check if the starting position is within the screen boundaries
	if (!IsValidPos_(col, row))
		return;

