Taseenk/stm32f4-ascii-graphics-demo/App/Src/terminal.c
	// Temporary buffer to hold the ANSI escape sequence (enough for a command like ESC[255;255H) and a string for the
	// whole terminal width
	char buffer[TERMINAL_WIDTH + 16];

	// Format the escape sequence to move the cursor and return the length
	// The length here is without the string terminator (\0)
	int len = snprintf(buffer, sizeof(buffer), ANSI_ESC "%u;%uH%s", (unsigned int)row, (unsigned int)col, str);

	// Check if sprintf failed (len < 0) or if the formatted string exceeded the terminal size
	if (len <= 0 || (size_t)len >= sizeof(buffer))
		return;

	// Transmit the escape sequence via using the precise length calculated by sprintf
	SerialPrintN(buffer, (uint16_t)len);
}

/**
 * @fn void TerminalBufferFlush(void)
 * @brief Sends the entire terminal framebuffer to the terminal display.
 * This function moves the cursor to the home position before transmitting
 * the framebuffer content using DMA for non-blocking transmission.
 */
void TerminalBufferFlush(void)
{
	// Move cursor to home before flushing the framebuffer
	TerminalCursorHome();

	// Send the entire framebuffer to the terminal
	SerialTransmitDMA((const char *)framebuffer, TERMINAL_BUFFER_SIZE);
}

/**
 * @fn void TerminalBufferClear(void)
 * @brief Clears the internal terminal framebuffer by filling it with space characters.
 * This function does NOT send any data to the terminal; it only updates the internal framebuffer.
 */
void TerminalBufferClear(void)
{
	// Fill the entire framebuffer with space characters
	memset(framebuffer, ' ', TERMINAL_BUFFER_SIZE);
}

/**
 * @fn void TerminalBufferDrawChar(char c, uint16_t col, uint16_t row)
 * @brief Draws a single character into the terminal framebuffer at the specified row and column.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to draw.
 * @param col The target column number (1-based index).
 * @param row The target row number (1-based index).
 */
void TerminalBufferDrawChar(char c, uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&col, &row);

	// Check if the starting position is within the screen boundaries
	if (!IsValidPos_(col, row))
		return;

	// Draw the character in the framebuffer using the internal function
	DrawChar_(c, col, row);
}

/**
 * @fn void TerminalBufferDrawString(const char *str, uint16_t col, uint16_t row)
 * @brief Draws a null-terminated string into the terminal framebuffer at the specified row and column.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param str The string to draw.
 * @param row The target row number (1-based index).
 * @param col The target column number (1-based index).
 */
void TerminalBufferDrawString(const char *str, uint16_t col, uint16_t row)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&col, &row);

	// Check if the starting position is within the screen boundaries
	if (!IsValidPos_(col, row))
		return;

	// Calculate the length of the string
	uint16_t len = (uint16_t)strlen(str);

	// Ensure the string fits within the terminal width
	// Subtract with 1 because the starting 'col' is included in the string length
	if (col + len - 1 > TERMINAL_WIDTH)
		return;

	// Store the string in the framebuffer using the internal function
	for (uint16_t i = 0; i < len; i++)
	{
		DrawChar_(str[i], col + i, row);
	}
}

/**
 * @fn void TerminalBufferDrawRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
 * @brief Draws a rectangle outline into the terminal framebuffer using the specified character.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the rectangle.
 * @param col The target starting column number (1-based index).
 * @param row The target starting row number (1-based index).
 * @param w The width of the rectangle in characters.
 * @param h The height of the rectangle in characters.
 */
void TerminalBufferDrawRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&col, &row);

	// Quick exit check if the starting position is within the screen boundaries
	// Also check is the rectangle is valid
	if (!IsValidPos_(col, row) || w == 0 || h == 0)
		return;

	// Calculate corner coordinates for x and y
	uint32_t right_col = col + (uint32_t)w - 1;
	uint32_t bottom_row = row + (uint32_t)h - 1;

	// Draw Top and Bottom edges
	for (uint16_t i = 0; i < w; i++)
	{
		DrawChar_(c, col + i, row);
		if (bottom_row <= TERMINAL_HEIGHT)
			DrawChar_(c, col + i, bottom_row);
	}

	// Draw Left and Right edges
	for (uint16_t j = 0; j < h; j++)
	{
		DrawChar_(c, col, row + j);
		if (right_col <= TERMINAL_WIDTH)
			DrawChar_(c, right_col, row + j);
	}
}

/**
 * @fn void TerminalBufferFillRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
 * @brief Fills a rectangle area in the terminal framebuffer using the specified character.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for filling the rectangle.
 * @param col The starting column (1-based index).
 * @param row The starting row (1-based index).
 * @param w The width of the rectangle.
 * @param h The height of the rectangle.
 */
void TerminalBufferFillRect(char c, uint16_t col, uint16_t row, uint16_t w, uint16_t h)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&col, &row);

	// Quick exit check if the starting position is within the screen boundaries
	// Also check is the rectangle is valid
	if (!IsValidPos_(col, row) || w == 0 || h == 0)
		return;

	// Calculate corner coordinates for x and y
	uint32_t right_col = col + (uint32_t)w - 1;
	uint32_t bottom_row = row + (uint32_t)h - 1;

	// Clamp width and height to terminal boundaries
	w = (right_col > TERMINAL_WIDTH) ? (TERMINAL_WIDTH - col + 1) : w;
	h = (bottom_row > TERMINAL_HEIGHT) ? (TERMINAL_HEIGHT - row + 1) : h;

	// Fill the rectangle area in the framebuffer
	for (uint16_t j = 0; j < h; j++)
	{
		for (uint16_t i = 0; i < w; i++)
		{
			DrawChar_(c, col + i, row + j);
		}
	}
}

/**
 * @fn void TerminalBufferDrawLine(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
 * @brief Draws a line between two points in the terminal framebuffer using Bresenham's algorithm.
 * This function determines whether to draw a horizontal or vertical line based on
 * the slope and updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the line.
 * @param x0 The starting column (1-based index).
 * @param y0 The starting row (1-based index).
 * @param x1 The ending column (1-based index).
 * @param y1 The ending row (1-based index).
 */
void TerminalBufferDrawLine(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&x0, &y0);
	NormalizeCoordinates_(&x1, &y1);

	// Check if the line is not off the screen
	if ((x0 > TERMINAL_WIDTH && x1 > TERMINAL_WIDTH) || (y0 > TERMINAL_HEIGHT && y1 > TERMINAL_HEIGHT))
		return;

	// Draw the line using the internal function
	DrawLine_(c, x0, y0, x1, y1);
}

/**
 * @fn void TerminalBufferDrawTriangle(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t
 * y2)
 * @brief Draws a triangle outline between three points in the terminal framebuffer using Bresenham's algorithm.
 * This function updates the internal framebuffer array but does NOT send any data to the terminal.
 * @param c The character to use for drawing the triangle.
 * @param x0 The column of Vertex A (1-based index).
 * @param y0 The row of Vertex A (1-based index).
 * @param x1 The column of Vertex B (1-based index).
 * @param y1 The row of Vertex B (1-based index).
 * @param x2 The column of Vertex C (1-based index).
 * @param y2 The row of Vertex C (1-based index).
 */
void TerminalBufferDrawTriangle(char c, uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
	// Make row and column always be 1 or greater for ANSI terminals
	NormalizeCoordinates_(&x0, &y0);
	NormalizeCoordinates_(&x1, &y1);
	NormalizeCoordinates_(&x2, &y2);

	// Check if the triangle is not off the screen
	if ((x0 > TERMINAL_WIDTH && x1 > TERMINAL_WIDTH && x2 > TERMINAL_WIDTH) ||
	    (y0 > TERMINAL_HEIGHT && y1 > TERMINAL_HEIGHT && y2 > TERMINAL_HEIGHT))
		return;

